; domain
(define (domain joint_teleport-assistance6_domain)
(:requirements :typing :action-costs)

(:types
    place telstatus - object
)

(:constants
    origin destination disabled - telstatus
)

(:predicates
    (prime_turn)
    (supporter_turn)
    (at-prime ?p -  place)
    (at-teleport ?p - place ?s -  telstatus)
    (teleport_origin_can_be_activated)
    (teleport_destination_can_be_activated)
    (adj-walk ?p1 - place ?p2 -  place)
)

(:functions
    (total-cost) - number
)

(:action sup_activate-teleport-origin
    :parameters (?pos - place)
    :precondition (and
        (supporter_turn)
        (teleport_origin_can_be_activated)
        (at-teleport ?pos disabled)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-teleport ?pos origin)
        (not (teleport_origin_can_be_activated))
        (not (at-teleport ?pos disabled))
        (increase (total-cost) 1.0)
    )
)

(:action sup_activate-teleport-destination
    :parameters (?pos - place)
    :precondition (and
        (supporter_turn)
        (teleport_destination_can_be_activated)
        (at-teleport ?pos disabled)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-teleport ?pos destination)
        (not (teleport_destination_can_be_activated))
        (not (at-teleport ?pos disabled))
        (increase (total-cost) 1.0)
    )
)

(:action sup_use-teleport
    :parameters (?pos1 ?pos2 - place)
    :precondition (and
        (supporter_turn)
        (at-prime ?pos1)
        (at-teleport ?pos1 origin)
        (at-teleport ?pos2 destination)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-prime ?pos2)
        (not (at-prime ?pos1))
        (increase (total-cost) 1.0)
    )
)

(:action pri_walk
    :parameters (?from - place ?to - place)
    :precondition (and
        (prime_turn)
        (adj-walk ?from ?to)
        (at-prime ?from)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?to)
        (not (at-prime ?from))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_noop
    :parameters ()
    :precondition (and
        (prime_turn)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (increase (total-cost) 0)
    )
)

(:action sup_noop
    :parameters ()
    :precondition (and
        (supporter_turn)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (increase (total-cost) 0)
    )
)

)

; problem
(define (problem joint_teleport-assistance6_problem_94)
(:domain joint_teleport-assistance6_domain)
(:objects
    pos0-0 pos0-1 pos0-4 pos0-5 pos1-3 pos1-4 pos1-5 pos1-6 pos2-1 pos2-3 pos2-4 pos2-5 pos2-6 pos3-0 pos3-1 pos3-2 pos3-5 pos3-6 pos4-0 pos4-1 pos4-2 pos4-3 pos4-4 pos4-6 pos5-1 pos5-4 pos5-5 pos5-6 pos6-0 pos6-1 pos6-2 pos6-3 pos6-4 pos6-6 pos7-0 pos7-3 pos7-4 pos7-5 pos8-0 pos8-1 pos8-2 pos8-3 pos8-6 pos9-0 pos9-4 pos9-6 - place
)

(:init
    (= (total-cost) 0)
    (supporter_turn)
    (at-teleport pos3-0 disabled)
    (at-teleport pos4-3 disabled)
    (at-teleport pos0-5 disabled)
    (at-teleport pos7-5 disabled)
    (at-teleport pos5-4 disabled)
    (teleport_origin_can_be_activated)
    (teleport_destination_can_be_activated)
    (at-prime pos9-0)
    (adj-walk pos0-0 pos0-1)
    (adj-walk pos0-1 pos0-0)
    (adj-walk pos0-4 pos0-5)
    (adj-walk pos0-5 pos0-4)
    (adj-walk pos0-4 pos1-4)
    (adj-walk pos1-4 pos0-4)
    (adj-walk pos0-5 pos1-5)
    (adj-walk pos1-5 pos0-5)
    (adj-walk pos1-3 pos1-4)
    (adj-walk pos1-4 pos1-3)
    (adj-walk pos1-3 pos2-3)
    (adj-walk pos2-3 pos1-3)
    (adj-walk pos1-4 pos1-5)
    (adj-walk pos1-5 pos1-4)
    (adj-walk pos1-4 pos2-4)
    (adj-walk pos2-4 pos1-4)
    (adj-walk pos1-5 pos1-6)
    (adj-walk pos1-6 pos1-5)
    (adj-walk pos1-5 pos2-5)
    (adj-walk pos2-5 pos1-5)
    (adj-walk pos1-6 pos2-6)
    (adj-walk pos2-6 pos1-6)
    (adj-walk pos2-1 pos3-1)
    (adj-walk pos3-1 pos2-1)
    (adj-walk pos2-3 pos2-4)
    (adj-walk pos2-4 pos2-3)
    (adj-walk pos2-4 pos2-5)
    (adj-walk pos2-5 pos2-4)
    (adj-walk pos2-5 pos2-6)
    (adj-walk pos2-6 pos2-5)
    (adj-walk pos2-5 pos3-5)
    (adj-walk pos3-5 pos2-5)
    (adj-walk pos2-6 pos3-6)
    (adj-walk pos3-6 pos2-6)
    (adj-walk pos3-0 pos3-1)
    (adj-walk pos3-1 pos3-0)
    (adj-walk pos3-0 pos4-0)
    (adj-walk pos4-0 pos3-0)
    (adj-walk pos3-1 pos3-2)
    (adj-walk pos3-2 pos3-1)
    (adj-walk pos3-1 pos4-1)
    (adj-walk pos4-1 pos3-1)
    (adj-walk pos3-2 pos4-2)
    (adj-walk pos4-2 pos3-2)
    (adj-walk pos3-5 pos3-6)
    (adj-walk pos3-6 pos3-5)
    (adj-walk pos3-6 pos4-6)
    (adj-walk pos4-6 pos3-6)
    (adj-walk pos4-0 pos4-1)
    (adj-walk pos4-1 pos4-0)
    (adj-walk pos4-1 pos4-2)
    (adj-walk pos4-2 pos4-1)
    (adj-walk pos4-1 pos5-1)
    (adj-walk pos5-1 pos4-1)
    (adj-walk pos4-2 pos4-3)
    (adj-walk pos4-3 pos4-2)
    (adj-walk pos4-3 pos4-4)
    (adj-walk pos4-4 pos4-3)
    (adj-walk pos4-4 pos5-4)
    (adj-walk pos5-4 pos4-4)
    (adj-walk pos4-6 pos5-6)
    (adj-walk pos5-6 pos4-6)
    (adj-walk pos5-1 pos6-1)
    (adj-walk pos6-1 pos5-1)
    (adj-walk pos5-4 pos5-5)
    (adj-walk pos5-5 pos5-4)
    (adj-walk pos5-4 pos6-4)
    (adj-walk pos6-4 pos5-4)
    (adj-walk pos5-5 pos5-6)
    (adj-walk pos5-6 pos5-5)
    (adj-walk pos5-6 pos6-6)
    (adj-walk pos6-6 pos5-6)
    (adj-walk pos6-0 pos6-1)
    (adj-walk pos6-1 pos6-0)
    (adj-walk pos6-0 pos7-0)
    (adj-walk pos7-0 pos6-0)
    (adj-walk pos6-1 pos6-2)
    (adj-walk pos6-2 pos6-1)
    (adj-walk pos6-2 pos6-3)
    (adj-walk pos6-3 pos6-2)
    (adj-walk pos6-3 pos6-4)
    (adj-walk pos6-4 pos6-3)
    (adj-walk pos6-3 pos7-3)
    (adj-walk pos7-3 pos6-3)
    (adj-walk pos6-4 pos7-4)
    (adj-walk pos7-4 pos6-4)
    (adj-walk pos7-0 pos8-0)
    (adj-walk pos8-0 pos7-0)
    (adj-walk pos7-3 pos7-4)
    (adj-walk pos7-4 pos7-3)
    (adj-walk pos7-3 pos8-3)
    (adj-walk pos8-3 pos7-3)
    (adj-walk pos7-4 pos7-5)
    (adj-walk pos7-5 pos7-4)
    (adj-walk pos8-0 pos8-1)
    (adj-walk pos8-1 pos8-0)
    (adj-walk pos8-0 pos9-0)
    (adj-walk pos9-0 pos8-0)
    (adj-walk pos8-1 pos8-2)
    (adj-walk pos8-2 pos8-1)
    (adj-walk pos8-2 pos8-3)
    (adj-walk pos8-3 pos8-2)
    (adj-walk pos8-6 pos9-6)
    (adj-walk pos9-6 pos8-6)
)

(:goal
  (and
    (at-prime pos2-4)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (sup_activate-teleport-destination pos0-5)
   deleted: (supporter_turn) (teleport_destination_can_be_activated) (at-teleport pos0-5 disabled)
   added: (prime_turn) (at-teleport pos0-5 destination)
   goals met: 0 of 1
2. (pri_walk pos9-0 pos8-0)
   deleted: (prime_turn) (at-prime pos9-0)
   added: (supporter_turn) (at-prime pos8-0)
   goals met: 0 of 1
3. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
4. (pri_walk pos8-0 pos7-0)
   deleted: (prime_turn) (at-prime pos8-0)
   added: (supporter_turn) (at-prime pos7-0)
   goals met: 0 of 1
5. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
6. (pri_walk pos7-0 pos6-0)
   deleted: (prime_turn) (at-prime pos7-0)
   added: (supporter_turn) (at-prime pos6-0)
   goals met: 0 of 1
7. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
8. (pri_walk pos6-0 pos6-1)
   deleted: (prime_turn) (at-prime pos6-0)
   added: (supporter_turn) (at-prime pos6-1)
   goals met: 0 of 1
9. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
10. (pri_walk pos6-1 pos6-2)
   deleted: (prime_turn) (at-prime pos6-1)
   added: (supporter_turn) (at-prime pos6-2)
   goals met: 0 of 1
11. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
12. (pri_walk pos6-2 pos6-3)
   deleted: (prime_turn) (at-prime pos6-2)
   added: (supporter_turn) (at-prime pos6-3)
   goals met: 0 of 1
13. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
14. (pri_walk pos6-3 pos6-4)
   deleted: (prime_turn) (at-prime pos6-3)
   added: (supporter_turn) (at-prime pos6-4)
   goals met: 0 of 1
15. (sup_activate-teleport-origin pos5-4)
   deleted: (supporter_turn) (teleport_origin_can_be_activated) (at-teleport pos5-4 disabled)
   added: (prime_turn) (at-teleport pos5-4 origin)
   goals met: 0 of 1
16. (pri_walk pos6-4 pos5-4)
   deleted: (prime_turn) (at-prime pos6-4)
   added: (supporter_turn) (at-prime pos5-4)
   goals met: 0 of 1
17. (sup_use-teleport pos5-4 pos0-5)
   deleted: (supporter_turn) (at-prime pos5-4)
   added: (prime_turn) (at-prime pos0-5)
   goals met: 0 of 1
18. (pri_walk pos0-5 pos0-4)
   deleted: (prime_turn) (at-prime pos0-5)
   added: (supporter_turn) (at-prime pos0-4)
   goals met: 0 of 1
19. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
20. (pri_walk pos0-4 pos1-4)
   deleted: (prime_turn) (at-prime pos0-4)
   added: (supporter_turn) (at-prime pos1-4)
   goals met: 0 of 1
21. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
22. (pri_walk pos1-4 pos2-4)
   deleted: (prime_turn) (at-prime pos1-4)
   added: (supporter_turn) (at-prime pos2-4)
   goals met: 1 of 1
